ruby_on_rails/assignment3/app/repositories/post_repository.rb

INSERT INTO `posts` (`title`, `description`, `public_flag`, `user_name`, `created_at`, `updated_at`) VALUES (';fddsja', 'jfbjfnbjsbnjanbajbn', FALSE, 'ko ko thura', '2022-01-07 13:26:03.599054', '2022-01-07 13:26:03.599054')
---
    def create_post(post)
      @is_post_create = post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 28 LIMIT 1
---
    def get_post_by_id(id)
      @post = Post.find(id)

DELETE FROM `posts` WHERE `posts`.`id` = 28
---
    def destroy_post(post)
      post.destroy