tutorials/tutorial_09/app/controllers/articles_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `articles` (`title`, `description`, `public_flag`, `user_id`, `created_at`, `updated_at`) VALUES ('ruby', 'Ruby on rails', FALSE, 1, '2021-12-28 13:23:04.348494', '2021-12-28 13:23:04.348494')
---
  def create
    @user = User.find(params[:user_id])
    @article = @user.articles.create(article_params)