tutorials/tutorial_09/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    # check new user is save or not
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password`, `super_user_flag`, `phone`, `address`, `birthday`, `created_at`, `updated_at`) VALUES ('Daza', 'daza@gmail.com', '12345', FALSE, '09123456789', 'gjeioagjaogjogesojgoajgaojgpo', '2021-12-04', '2021-12-28 10:54:02.712895', '2021-12-28 10:54:02.712895')

  def edit
    # store id to make operation specific row
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def update
    @user = User.find(params[:id])

    # update user's data
    if @user.update(user_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `users`.`password` = '23456', `users`.`super_user_flag` = FALSE, `users`.`address` = 'dddsfafdafdfdfsafsfdafsaf', `users`.`updated_at` = '2021-12-28 11:21:46.870415' WHERE `users`.`id` = 1