tutorials/tutorial_09/app/views/users/show.html.erb

  <%# show created articles %>
  <% unless @user.articles.empty? %>
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 4