tutorials/tutorial_08/app/controllers/posts_controller.rb

  def index
    # retreive all data from db
    @members = Post.all
---
SELECT `posts`.* FROM `posts`

  def show
    # store id to make operation specific row
    @member = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 11 LIMIT 1

  def create
    puts "test data = #{member_params}"
    @member = Post.new(member_params)

    # save new member's row in db
    if @member.save
---
INSERT INTO `posts` (`title`, `description`, `public_flag`, `user_name`, `created_at`, `updated_at`) VALUES ('ph', 'laravel', FALSE, 'Thura', '2021-12-22 11:30:04.953707', '2021-12-22 11:30:04.953707')

  def edit
    # store id to make operation specific row
    @member = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 11 LIMIT 1

  def update
    @member = Post.find(params[:id])

    # update member's data
    if @member.update(member_params)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 12 LIMIT 1
UPDATE `posts` SET `posts`.`title` = 'PHP', `posts`.`description` = 'Laravel ', `posts`.`public_flag` = TRUE, `posts`.`updated_at` = '2021-12-22 11:30:23.946999' WHERE `posts`.`id` = 12

  def destroy
    @member = Post.find(params[:id])
    @member.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 13 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 13