ruby_on_rails/assignment3/app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `description`, `public_flag`, `user_name`, `created_at`, `updated_at`) VALUES ('bbbb', 'ccccccccccccccccccc', FALSE, 'aa', '2022-01-07 12:30:42.612153', '2022-01-07 12:30:42.612153')
---
  def create
    @member = Post.new(member_params)
    @is_post_create = PostService.create_post(@member)

DELETE FROM `posts` WHERE `posts`.`id` = 26
---
  def destroy
    @member = PostService.get_post_by_id(params[:id])
    PostService.destroy_post(@member)