ruby_on_rails/assignment3/app/views/posts/destroy.js.erb

DELETE FROM `posts` WHERE `posts`.`id` = 20
---
$('.delete_post').bind('ajax:success', function() {
  $(this).closest('tr').fadeOut();
});